In [ ]:
# Open python interpreter/ipython and do the following.

# 0.import pandas 
# 1.Using the emp.csv file available in common folder,create a data frame object named ef1.
# 2.Remove all the non digit characters from ephno column and store the new data in ef2. 
# 3.Write the three columns ename,edesig and esalary to the excel file empx.xlsx with sheet name as salary
# 4.Write the two columns ename and  ephno to the same excel file empx.xlsx with sheet name as phone  
# 5.In the data frame ef2 make edesig and eno as row index & store the new data in ef3
# 6.In ef3, sort the index edesig and store the result in ef4  
#     6.1.Using ef4, display all the scientists records.
#     6.2.Display average salary of engineers.
#     6.3.Display the lowest salary for scientist designation.

In [1]:
# 0 import pandas 

import pandas as pd
import numpy as np

In [16]:
# 1. Using the emp.csv file available in common folder,create a data frame object named ef1.

ef1 = pd.read_csv('emp.csv')
ef1.head()

             ename  eno     edesig  esalary           ephno
0            K.Raj  101  scientist  50000.0  (0493)-2287278
1     Mohan Raj M.  102   engineer  50000.0  [0496]-2287278
2            M.Ram  104  scientist  80000.0  (0491)-4287275
3        Ram Kumar  104  scientist  60000.0  (0491)-4287335
4  Mohan Babu K.K.  106    officer  50000.0  {0496}-2387278

In [35]:
# 2. Remove all the non digit characters from ephno column and store the new data in ef2. 

ef2 = ef1.copy()
ef2['ephno'] = ef2['ephno'].str.replace('\D', '')
ef2.head()

             ename  eno     edesig  esalary        ephno
0            K.Raj  101  scientist  50000.0  04932287278
1     Mohan Raj M.  102   engineer  50000.0  04962287278
2            M.Ram  104  scientist  80000.0  04914287275
3        Ram Kumar  104  scientist  60000.0  04914287335
4  Mohan Babu K.K.  106    officer  50000.0  04962387278

In [23]:
# 3. Write the three columns ename,edesig and esalary to the excel file empx.xlsx with sheet name as salary

ef1[['ename', 'edesig', 'esalary']].to_excel('empx.xlsx', sheet_name='salary')

In [25]:
! ls -l

total 24
-rw-rw-r-- 1 ai17 ai17 5697 Dec 13 16:57 day_27.ipynb
-rwxr--r-- 1 ai17 ai17  492 Nov 27  2018 emp.csv
-rw-rw-r-- 1 ai17 ai17 5739 Dec 13 16:58 empx.xlsx
-rwxr--r-- 1 ai17 ai17  785 Dec 13 13:54 Python Lab_Day27_12Dec.txt

In [29]:
# 4. Write the two columns ename and  ephno to the same excel file empx.xlsx with sheet name as phone  

with pd.ExcelWriter('empx.xlsx') as writer:
    ef1[['ename', 'ephno']].to_excel(writer, sheet_name='phone')

In [38]:
# 5. In the data frame ef2 make edesig and eno as row index & store the new data in ef3

ef3 = ef2.set_index('eno')
ef3.head()
# or ef2.index = ef2.eno

               ename     edesig  esalary        ephno
eno
101            K.Raj  scientist  50000.0  04932287278
102     Mohan Raj M.   engineer  50000.0  04962287278
104            M.Ram  scientist  80000.0  04914287275
104        Ram Kumar  scientist  60000.0  04914287335
106  Mohan Babu K.K.    officer  50000.0  04962387278

In [43]:
# 6. In ef3, sort the index edesig and store the result in ef4  

ef4 = ef3.sort_index()
print(ef4)

               ename     edesig  esalary        ephno
eno
101            K.Raj  scientist  50000.0  04932287278
102     Mohan Raj M.   engineer  50000.0  04962287278
104            M.Ram  scientist  80000.0  04914287275
104        Ram Kumar  scientist  60000.0  04914287335
106  Mohan Babu K.K.    officer  50000.0  04962387278
107          K.Gopal  scientist  50000.0  04932287278
108      Anil Raj M.   engineer  50000.0  04962287278
201         Amala P.  scientist  70000.0  04989287275
204             Uma     officer  60000.0  04914287335
206             Suma   engineer  50000.0  04962387278
         ename     edesig  esalary        ephno
eno
101      K.Raj  scientist  50000.0  04932287278
104      M.Ram  scientist  80000.0  04914287275
104  Ram Kumar  scientist  60000.0  04914287335
107    K.Gopal  scientist  50000.0  04932287278
201   Amala P.  scientist  70000.0  04989287275
50000.0
50000.0

In [46]:
# 6.1.Using ef4, display all the scientists records.

print(ef4[ef4['edesig']=='scientist'])

         ename     edesig  esalary        ephno
eno
101      K.Raj  scientist  50000.0  04932287278
104      M.Ram  scientist  80000.0  04914287275
104  Ram Kumar  scientist  60000.0  04914287335
107    K.Gopal  scientist  50000.0  04932287278
201   Amala P.  scientist  70000.0  04989287275

In [45]:
# 6.2.Display average salary of engineers.

print(ef4[ef4['edesig']=='engineer']['esalary'].mean())

50000.0

In [48]:
# 6.3.Display the lowest salary for scientist designation.

print(ef4[ef4['edesig']=='scientist']['esalary'].min())

50000.0